{
    "status": "success",
    "message": "Product data retrieved successfully",
    "data": [
        {
            "novelTitle": "The Great Gatsbi",
            "statu": "Completed",
            "year": "1925",
            "fav":false,
            "description": "In the spring of 1922, Nick Carraway moves from the Midwest to New York City to chase his American dream. He rents a small house in the fictional village of West Egg on Long Island, next door to the extravagant mansion of Jay Gatsby, a mysterious millionaire who holds extravagant parties every weekend. Nick soon becomes embroiled in the decadent social scene of the wealthy elite, and through his relationship with Gatsby, learns the truth about his past and the lengths he will go to reclaim the love of his life, Daisy Buchanan.",
            "images":
                {
                    "imagePath": "https://upload.wikimedia.org/wikipedia/commons/7/7a/The_Great_Gatsby_Cover_1925_Retouched.jpg",
                    "imagePath2": "https://i.pinimg.com/564x/b6/26/b1/b626b1dd9055f2942efcc3ac8c772b11.jpg"
                },
            "rating": 9,
            "chapiters":[
                
                {"chapiter":"In my younger and more vulnerable years my father gaveme some advice that I’ve been turning over in my mindever since.‘Whenever you feel like criticizing any one,’ he told me,‘just remember that all the people in this world haven’t hadthe advantages that you’ve had.’He didn’t say any more but we’ve always been unusuallycommunicative in a reserved way, and I understood that hemeant a great deal more than that. In consequence I’m in-clined to reserve all judgments, a habit that has opened upmany curious natures to me and also made me the victimof not a few veteran bores. The abnormal mind is quick todetect and attach itself to this quality when it appears in anormal person, and so it came about that in college I wasunjustly accused of being a politician, because I was privyto the secret griefs of wild, unknown men. Most of the con-fidences were unsought—frequently I have feigned sleep,preoccupation, or a hostile levity when I realized by someunmistakable sign that an intimate revelation was quiver-ing on the horizon—for the intimate revelations of youngmen or at least the terms in which they express them areusually plagiaristic and marred by obvious suppressions.Reserving judgments is a matter of infinite hope. I am stilla little afraid of missing something if I forget that, as my fa-","chpiterTitle":"Death","key":1},
                {"chapiter":"ther snobbishly suggested, and I snobbishly repeat a senseof the fundamental decencies is parcelled out unequally atbirth.And, after boasting this way of my tolerance, I come tothe admission that it has a limit. Conduct may be foundedon the hard rock or the wet marshes but after a certain pointI don’t care what it’s founded on. When I came back fromthe East last autumn I felt that I wanted the world to be inuniform and at a sort of moral attention forever; I want-ed no more riotous excursions with privileged glimpsesinto the human heart. Only Gatsby, the man who gives hisname to this book, was exempt from my reaction—Gatsbywho represented everything for which I have an unaffect-ed scorn. If personality is an unbroken series of successfulgestures, then there was something gorgeous about him,some heightened sensitivity to the promises of life, as if hewere related to one of those intricate machines that registerearthquakes ten thousand miles away. This responsivenesshad nothing to do with that flabby impressionability whichis dignified under the name of the ‘creative temperament’—it was an extraordinary gift for hope, a romantic readinesssuch as I have never found in any other person and whichit is not likely I shall ever find again. No—Gatsby turnedout all right at the end; it is what preyed on Gatsby, whatfoul dust floated in the wake of his dreams that temporarilyclosed out my interest in the abortive sorrows and short-winded elations of men.My family have been prominent, well-to-do people inthis middle-western city for three generations. The Car-","chpiterTitle":"Death","key":2},
                {"chapiter":"raways are something of a clan and we have a tradition that we’re descended from the Dukes of Buccleuch, but the ac-tual founder of my line was my grandfather’s brother whocame here in fifty-one, sent a substitute to the Civil War andstarted the wholesale hardware business that my father car-ries on today.I never saw this great-uncle but I’m supposed to looklike him—with special reference to the rather hard-boiledpainting that hangs in Father’s office. I graduated from NewHaven in 1915, just a quarter of a century after my father,and a little later I participated in that delayed Teutonic mi-gration known as the Great War. I enjoyed the counter-raidso thoroughly that I came back restless. Instead of being thewarm center of the world the middle-west now seemed likethe ragged edge of the universe—so I decided to go east andlearn the bond business. Everybody I knew was in the bondbusiness so I supposed it could support one more singleman. All my aunts and uncles talked it over as if they werechoosing a prep-school for me and finally said, ‘Why—ye-es’ with very grave, hesitant faces. Father agreed to financeme for a year and after various delays I came east, perma-nently, I thought, in the spring of twenty-two.The practical thing was to find rooms in the city but it wasa warm season and I had just left a country of wide lawnsand friendly trees, so when a young man at the office sug-gested that we take a house together in a commuting townit sounded like a great idea. He found the house, a weatherbeaten cardboard bungalow at eighty a month, but at thelast minute the firm ordered him to Washington and I went","chpiterTitle":"Death","key":3},
                {"chapiter":"out to the country alone. I had a dog, at least I had him for afew days until he ran away, and an old Dodge and a Finnishwoman who made my bed and cooked breakfast and mut-tered Finnish wisdom to herself over the electric stove.It was lonely for a day or so until one morning some man,more recently arrived than I, stopped me on the road.‘How do you get to West Egg village?’ he asked helpless-ly.I told him. And as I walked on I was lonely no longer. Iwas a guide, a pathfinder, an original settler. He had casu-ally conferred on me the freedom of the neighborhood.And so with the sunshine and the great bursts of leavesgrowing on the trees—just as things grow in fast movies—Ihad that familiar conviction that life was beginning overagain with the summer.There was so much to read for one thing and so muchfine health to be pulled down out of the young breath-giv-ing air. I bought a dozen volumes on banking and credit andinvestment securities and they stood on my shelf in red andgold like new money from the mint, promising to unfoldthe shining secrets that only Midas and Morgan and Mae-cenas knew. And I had the high intention of reading manyother books besides. I was rather literary in college—oneyear I wrote a series of very solemn and obvious editorialsfor the ‘Yale News’—and now I was going to bring back allsuch things into my life and become again that most limitedof all specialists, the ‘well-rounded man.’ This isn’t just anepigram—life is much more successfully looked at from asingle window, after all.","chpiterTitle":"Death","key":4},
                {"chapiter":"It was a matter of chance that I should have rented ahouse in one of the strangest communities in North Ameri-ca. It was on that slender riotous island which extends itselfdue east of New York and where there are, among othernatural curiosities, two unusual formations of land. Twentymiles from the city a pair of enormous eggs, identical incontour and separated only by a courtesy bay, jut out intothe most domesticated body of salt water in the WesternHemisphere, the great wet barnyard of Long Island Sound.They are not perfect ovals—like the egg in the Columbusstory they are both crushed flat at the contact end—buttheir physical resemblance must be a source of perpetualconfusion to the gulls that fly overhead. To the wingless amore arresting phenomenon is their dissimilarity in everyparticular except shape and size.I lived at West Egg, the—well, the less fashionable of thetwo, though this is a most superficial tag to express the bi-zarre and not a little sinister contrast between them. Myhouse was at the very tip of the egg, only fifty yards from theSound, and squeezed between two huge places that rentedfor twelve or fifteen thousand a season. The one on my rightwas a colossal affair by any standard—it was a factual imi-tation of some Hôtel de Ville in Normandy, with a tower onone side, spanking new under a thin beard of raw ivy, and amarble swimming pool and more than forty acres of lawnand garden. It was Gatsby’s mansion. Or rather, as I didn’tknow Mr. Gatsby it was a mansion inhabited by a gentle-man of that name. My own house was an eye-sore, but itwas a small eye-sore, and it had been overlooked, so I had a","chpiterTitle":"Death","key":5},
                {"chapiter":"view of the water, a partial view of my neighbor’s lawn, andthe consoling proximity of millionaires—all for eighty dol-lars a month.Across the courtesy bay the white palaces of fashionableEast Egg glittered along the water, and the history of thesummer really begins on the evening I drove over there tohave dinner with the Tom Buchanans. Daisy was my secondcousin once removed and I’d known Tom in college. Andjust after the war I spent two days with them in Chicago.Her husband, among various physical accomplishments,had been one of the most powerful ends that ever playedfootball at New Haven—a national figure in a way, one ofthose men who reach such an acute limited excellence attwenty-one that everything afterward savors of anti-cli-max. His family were enormously wealthy—even in collegehis freedom with money was a matter for reproach—butnow he’d left Chicago and come east in a fashion that rathertook your breath away: for instance he’d brought down astring of polo ponies from Lake Forest. It was hard to real-ize that a man in my own generation was wealthy enoughto do that.Why they came east I don’t know. They had spent a yearin France, for no particular reason, and then drifted hereand there unrestfully wherever people played polo and wererich together. This was a permanent move, said Daisy overthe telephone, but I didn’t believe it—I had no sight intoDaisy’s heart but I felt that Tom would drift on forever seek-ing a little wistfully for the dramatic turbulence of someirrecoverable football game.","chpiterTitle":"Death","key":6}
            
        ]
        },
        {
            "novelTitle": "To Kill a Mockingbird",
            "statu": "Completed",
            "year": 1960,
            "fav":false,
            "description": "Set in the fictional town of Maycomb, Alabama during the Great Depression, the novel explores the themes of racial injustice and the loss of innocence through the eyes of the young narrator, Scout Finch. When her father, a lawyer named Atticus Finch, is appointed to defend a black man accused of rape, Scout and her brother Jem witness firsthand the prejudice and hatred that exists in their community. Through their father's guidance, they learn the importance of empathy and standing up for what is right, even in the face of overwhelming opposition.",
            "images":
                {
                    "imagePath": "https://i.pinimg.com/564x/72/d4/88/72d4885daa51240d7b916b778e90f172.jpg",
                    "imagePath2": "https://i.pinimg.com/564x/8f/af/5e/8faf5e39ee67c2c8e6c073a3f0af6ddf.jpg"
                },
            "rating": 4.7,
            "chapiters":[
                
                    {"chapiter":"When he was nearly thirteen, my brother Jem got his arm badly broken at the elbow. When it healed, and Jem’s fears of never being able to play football were assuaged, he was seldom self-conscious about his injury. His left arm was somewhat shorter than his right; when he stood or walked, the back of his hand was at right angles to his body, his thumb parallel to his thigh. He couldn’t have cared less, so long as he could pass and punt. When enough years had gone by to enable us to look back on them, we sometimes discussed the events leading to his accident. I maintain that the Ewells started it all, but Jem, who was four years my senior, said it started long before that. He said it began the summer Dill came to us, when Dill first gave us the idea of making Boo Radley come out. I said if he wanted to take a broad view of the thing, it really began with Andrew Jackson. If General Jackson hadn’t run the Creeks up the creek, Simon Finch would never have paddled up the Alabama, and where would we be if he hadn’t?  We were far too old to settle an argument with a fist-fight, so we consulted Atticus. Our father said we were both right. Being Southerners, it was a source of shame to some members of the family that we had no recorded ancestors on either side of the Battle of Hastings. All we had was Simon Finch, a fur-trapping apothecary from Cornwall whose piety was exceeded only by his stinginess. In England, Simon was irritated by the persecution of those who called themselves Methodists at the hands of their more liberal brethren, and as Simon called himself a Methodist, he worked his way across the Atlantic to Philadelphia, thence to Jamaica, thence to Mobile, and up the Saint Stephens. Mindful of John Wesley’s strictures on the use of many words in buying and selling, Simon made a pile practicing medicine, but in this pursuit he was unhappy lest he be tempted into doing what he knew was not for the glory of God, as the putting on of gold and costly apparel. So Simon, having forgotten his teacher’s dictum on the possession of human chattels, bought three slaves and with their aid established a homestead on the banks of the Alabama River some forty miles above Saint Stephens. He returned to Saint Stephens only once, to find a wife, and with her established a line that ran high to daughters. Simon lived to an impressive age and died rich. It was customary for the men in the family to remain on Simon’s homestead, Finch’s Landing, and make their living from cotton. The place was self-sufficient: modest in comparison with the empires around it, the Landing nevertheless produced everything required to sustain life except ice, wheat flour, and articles of clothing, supplied by river-boats from Mobile. Simon would have regarded with impotent fury the disturbance between the North and the South, as it left his descendants stripped of everything but their land, yet the tradition of living on the land remained unbroken until well into the twentieth century, when my father, Atticus Finch, went to Montgomery to read law, and his younger brother went to Boston to study medicine. Their sister Alexandra was the Finch who remained at the Landing: she married a taciturn man who spent most of his time lying in a hammock by the river wondering if his trot-lines were full. When my father was admitted to the bar, he returned to Maycomb and began his practice. Maycomb, some twenty miles east of Finch’s Landing, was the county  seat of Maycomb County. Atticus’s office in the courthouse contained little more than a hat rack, a spittoon, a checkerboard and an unsullied Code of Alabama. His first two clients were the last two persons hanged in the Maycomb County jail. Atticus had urged them to accept the state’s generosity in allowing them to plead Guilty to second-degree murder and escape with their lives, but they were Haverfords, in Maycomb County a name synonymous with jackass. The Haverfords had dispatched Maycomb’s leading blacksmith in a misunderstanding arising from the alleged wrongful detention of a mare, were imprudent enough to  do it in the presence of three witnesses, and insisted that the-son-of-a-bitch-had-it- coming-to-him was a good enough defense for anybody. They persisted in  pleading Not Guilty to first-degree murder, so there was nothing much Atticus could do for his clients except be present at their departure, an occasion that was probably the beginning of my father’s profound distaste for the practice of criminal law. During his first five years in Maycomb, Atticus practiced economy more than anything; for several years thereafter he invested his earnings in his brother’s education. John Hale Finch was ten years younger than my father, and chose to study medicine at a time when cotton was not worth growing; but after getting Uncle Jack started, Atticus derived a reasonable income from the law. He liked Maycomb, he was Maycomb County born and bred; he knew his people, they knew him, and because of Simon Finch’s industry, Atticus was related by blood or marriage to nearly every family in the town.  Maycomb was an old town, but it was a tired old town when I first knew it. In rainy weather the streets turned to red slop; grass grew on the sidewalks, the courthouse sagged in the square. Somehow, it was hotter then: a black dog suffered on a summer’s day; bony mules hitched to Hoover carts flicked flies in the sweltering shade of the live oaks on the square. Men’s stiff collars wilted by nine in the morning. Ladies bathed before noon, after their three-o’clock naps, and by nightfall were like soft teacakes with frostings of sweat and sweet talcum. People moved slowly then. They ambled across the square, shuffled in and out of the stores around it, took their time about everything. A day was twenty-four  hours long but seemed longer. There was no hurry, for there was nowhere to go, nothing to buy and no money to buy it with, nothing to see outside the boundaries of Maycomb County. But it was a time of vague optimism for some of the people: Maycomb County had recently been told that it had nothing to fear but fear itself. We lived on the main residential street in town— Atticus, Jem and I, plus Calpurnia our cook. Jem and I found our father satisfactory: he played with us, read to us, and treated us with courteous detachment. Calpurnia was something else again. She was all angles and bones; she was nearsighted; she squinted; her hand was wide as a bed slat and twice as hard. She was always ordering me out of the kitchen, asking me why I couldn’t behave as well as Jem when she knew he was older, and calling me home when I wasn’t ready to come. Our battles were epic and one-sided. Calpurnia always won, mainly because Atticus always took her side. She had been with us ever since Jem was born, and I had felt her tyrannical presence as long as I could remember. Our mother died when I was two, so I never felt her absence. She was a Graham from Montgomery; Atticus met her when he was first elected to the state legislature. He was middle-aged then, she was fifteen years his junior. Jem was the product of their first year of marriage; four years later I was born, and two years later our mother died from a sudden heart attack. They said it ran in her family. I did not miss her, but I think Jem did. He remembered her clearly, and sometimes in the middle of a game he would sigh at length, then go off and play by himself behind the car-house. When he was like that, I knew better than to bother him. When I was almost six and Jem was nearly ten, our summertime boundaries (within calling distance of Calpurnia) were Mrs. Henry Lafayette Dubose’s house two doors to the north of us, and the Radley Place three doors to the south. We were never tempted to break them. The Radley Place was inhabited by an unknown entity the mere description of whom was enough to make us behave for days on end; Mrs. Dubose was plain hell. That was the summer Dill came to us. Early one morning as we were beginning our day’s play in the back yard, Jem and I heard something next door in Miss Rachel Haverford’s collard patch.","chpiterTitle":"Death","key":1},
                    {"chapiter":"to the wire fence to see if there was a puppy— Miss Rachel’s rat terrier was expecting— instead we found someone sitting looking at us. Sitting down, he wasn’t much higher than the collards. We stared at him until he spoke: “Hey.” “Hey yourself,” said Jem pleasantly. “I’m Charles Baker Harris,” he said. “I can read.” “So what?” I said. “I just thought you’d like to know I can read. You got anything needs readin‘ I can do it...” “How old are you,” asked Jem, “four-and-a-half?” “Goin‘ on seven.” “Shoot no wonder, then,” said Jem, jerking his thumb at me. “Scout yonder’s been readin‘ ever since she was born, and she ain’t even started to school yet. You look right puny for goin’ on seven.” “I’m little but I’m old,” he said. Jem brushed his hair back to get a better look. “Why don’t you come over, Charles Baker Harris?” he said. “Lord, what a name.” “‘s not any funnier’n yours. Aunt Rachel says your name’s Jeremy Atticus Finch.” Jem scowled. “I’m big enough to fit mine,” he said. “Your name’s longer’n you are. Bet it’s a foot longer.” “Folks call me Dill,” said Dill, struggling under the fence. “Do better if you go over it instead of under it,” I said. “Where’d you come from?” Dill was from Meridian, Mississippi, was spending the summer with his aunt, Miss Rachel, and would be spending every summer in Maycomb from now on. His family was from Maycomb County originally, his mother worked for a photographer in Meridian, had entered his picture in a Beautiful Child contest and won five dollars. She gave the money to Dill, who went to the picture show twenty times on it. “Don’t have any picture shows here, except Jesus ones in the courthouse sometimes,” said Jem. “Ever see anything good?”  Dill had seen Dracula, a revelation that moved Jem to eye him with the beginning of respect. “Tell it to us,” he said. Dill was a curiosity. He wore blue linen shorts that buttoned to his shirt, his hair was snow white and stuck to his head like duckfluff; he was a year my senior but I towered over him. As he told us the old tale his blue eyes would lighten and darken; his laugh was sudden and happy; he habitually pulled at a cowlick in the center of his forehead. When Dill reduced Dracula to dust, and Jem said the show sounded better than the book, I asked Dill where his father was: “You ain’t said anything about him.” “I haven’t got one.” “Is he dead?” “No...” “Then if he’s not dead you’ve got one, haven’t you?” Dill blushed and Jem told me to hush, a sure sign that Dill had been studied and found acceptable. Thereafter the summer passed in routine contentment. Routine contentment was: improving our treehouse that rested between giant twin chinaberry trees in the back yard, fussing, running through our list of dramas based on the works of Oliver Optic, Victor Appleton, and Edgar Rice Burroughs. In this matter we were lucky to have Dill. He played the character parts formerly thrust upon me— the ape in Tarzan, Mr. Crabtree in The Rover Boys, Mr. Damon in Tom Swift. Thus we came to know Dill as a pocket Merlin, whose head teemed with eccentric plans, strange longings, and quaint fancies. But by the end of August our repertoire was vapid from countless reproductions, and it was then that Dill gave us the idea of making Boo Radley come out. The Radley Place fascinated Dill. In spite of our warnings and explanations it drew him as the moon draws water, but drew him no nearer than the light-pole on the corner, a safe distance from the Radley gate. There he would stand, his arm around the fat pole, staring and wondering. The Radley Place jutted into a sharp curve beyond our house. Walking south, one faced its porch; the sidewalk turned and ran beside the lot. The house was low, was once white with a deep front porch and green shutters, but had long ago  darkened to the color of the slate-gray yard around it. Rain-rotted shingles drooped over the eaves of the veranda; oak trees kept the sun away. The remains of a picket drunkenly guarded the front yard— a “swept” yard that was never swept— where johnson grass and rabbit-tobacco grew in abundance. Inside the house lived a malevolent phantom. People said he existed, but Jem and I had never seen him. People said he went out at night when the moon was down, and peeped in windows. When people’s azaleas froze in a cold snap, it was because he had breathed on them. Any stealthy small crimes committed in Maycomb were his work. Once the town was terrorized by a series of morbid nocturnal events: people’s chickens and household pets were found mutilated; although the culprit was Crazy Addie, who eventually drowned himself in Barker’s Eddy, people still looked at the Radley Place, unwilling to discard their initial suspicions. A Negro would not pass the Radley Place at night, he would cut across to the sidewalk opposite and whistle as he walked. The Maycomb school grounds adjoined the back of the Radley lot; from the Radley chickenyard tall pecan trees shook their fruit into the schoolyard, but the nuts lay untouched by the children: Radley pecans would kill you. A baseball hit into the Radley yard was a lost ball and no questions asked. The misery of that house began many years before Jem and I were born. The Radleys, welcome anywhere in town, kept to themselves, a predilection unforgivable in Maycomb. They did not go to church, Maycomb’s principal recreation, but worshiped at home; Mrs. Radley seldom if ever crossed the street for a mid-morning coffee break with her neighbors, and certainly never joined a missionary circle. Mr. Radley walked to town at eleven-thirty every morning and came back promptly at twelve, sometimes carrying a brown paper bag that the neighborhood assumed contained the family groceries. I never knew how old Mr. Radley made his living— Jem said he “bought cotton,” a polite term for doing nothing—but Mr. Radley and his wife had lived there with their two sons as long as anybody could remember. The shutters and doors of the Radley house were closed on Sundays, another thing alien to Maycomb’s ways: closed doors meant illness and cold weather only. Of all days Sunday was the day for formal afternoon visiting: ladies wore corsets, men wore coats, children wore shoes. But to climb the Radley front steps","chpiterTitle":"Death","key":2},
                    {"chapiter":"and call, “He-y,” of a Sunday afternoon was something their neighbors never did. The Radley house had no screen doors. I once asked Atticus if it ever had any; Atticus said yes, but before I was born. According to neighborhood legend, when the younger Radley boy was in his teens he became acquainted with some of the Cunninghams from Old Sarum, an enormous and confusing tribe domiciled in the northern part of the county, and they formed the nearest thing to a gang ever seen in Maycomb. They did little, but enough to be discussed by the town and publicly warned from three pulpits: they hung around the barbershop; they rode the bus to Abbottsville on Sundays and went to the picture show; they attended dances at the county’s riverside gambling hell, the Dew-Drop Inn & Fishing Camp; they experimented with stumphole whiskey. Nobody in Maycomb had nerve enough to tell Mr. Radley that his boy was in with the wrong crowd. One night, in an excessive spurt of high spirits, the boys backed around the square in a borrowed flivver, resisted arrest by Maycomb’s ancient beadle, Mr. Conner, and locked him in the courthouse outhouse. The town decided something had to be done; Mr. Conner said he knew who each and every one of them was, and he was bound and determined they wouldn’t get away with it, so the boys came before the probate judge on charges of disorderly conduct, disturbing the peace, assault and battery, and using abusive and profane language in the presence and hearing of a female. The judge asked Mr. Conner why he included the last charge; Mr. Conner said they cussed so loud he was sure every lady in Maycomb heard them. The judge decided to send the boys to the state industrial school, where boys were sometimes sent for no other reason than to provide them with food and decent shelter: it was no prison and it was no disgrace. Mr. Radley thought it was. If the judge released Arthur, Mr. Radley would see to it that Arthur gave no further trouble. Knowing that Mr. Radley’s word was his bond, the judge was glad to do so. The other boys attended the industrial school and received the best secondary education to be had in the state; one of them eventually worked his way through engineering school at Auburn. The doors of the Radley house were closed on weekdays as well as Sundays, and Mr. Radley’s boy was not seen again for  fifteen years. But there came a day, barely within Jem’s memory, when Boo Radley was heard from and was seen by several people, but not by Jem. He said Atticus never talked much about the Radleys: when Jem would question him Atticus’s only answer was for him to mind his own business and let the Radleys mind theirs, they had a right to; but when it happened Jem said Atticus shook his head and said, “Mm, mm, mm.” So Jem received most of his information from Miss Stephanie Crawford, a neighborhood scold, who said she knew the whole thing. According to Miss Stephanie, Boo was sitting in the livingroom cutting some items from The Maycomb Tribune to paste in his scrapbook. His father entered the room. As Mr. Radley passed by, Boo drove the scissors into his parent’s leg, pulled them out, wiped them on his pants, and resumed his activities. Mrs. Radley ran screaming into the street that Arthur was killing them all, but when the sheriff arrived he found Boo still sitting in the livingroom, cutting up the Tribune. He was thirty-three years old then. Miss Stephanie said old Mr. Radley said no Radley was going to any asylum, when it was suggested that a season in Tuscaloosa might be helpful to Boo. Boo wasn’t crazy, he was high-strung at times. It was all right to shut him up, Mr. Radley conceded, but insisted that Boo not be charged with anything: he was not a criminal. The sheriff hadn’t the heart to put him in jail alongside Negroes, so Boo was locked in the courthouse basement. Boo’s transition from the basement to back home was nebulous in Jem’s memory. Miss Stephanie Crawford said some of the town council told Mr. Radley that if he didn’t take Boo back, Boo would die of mold from the damp. Besides, Boo could not live forever on the bounty of the county. Nobody knew what form of intimidation Mr. Radley employed to keep Boo out of sight, but Jem figured that Mr. Radley kept him chained to the bed most of the time. Atticus said no, it wasn’t that sort of thing, that there were other ways of making people into ghosts. My memory came alive to see Mrs. Radley occasionally open the front door, walk to the edge of the porch, and pour water on her cannas. But every day Jem and I  would see Mr. Radley walking to and from town. He was a thin leathery man with colorless eyes, so colorless they did not reflect light. His cheekbones were sharp and his mouth was wide, with a thin upper lip and a full lower lip. Miss Stephanie Crawford said he was so upright he took the word of God as his only law, and we believed her, because Mr. Radley’s posture was ramrod straight. He never spoke to us. When he passed we would look at the ground and say, “Good morning, sir,” and he would cough in reply. Mr. Radley’s elder son lived in Pensacola; he came home at Christmas, and he was one of the few persons we ever saw enter or leave the place. From the day Mr. Radley took Arthur home, people said the house died. But there came a day when Atticus told us he’d wear us out if we made any noise in the yard and commissioned Calpurnia to serve in his absence if she heard a sound out of us. Mr. Radley was dying. He took his time about it. Wooden sawhorses blocked the road at each end of the Radley lot, straw was put down on the sidewalk, traffic was diverted to the back street. Dr. Reynolds parked his car in front of our house and walked to the Radley’s every time he called. Jem and I crept around the yard for days. At last the sawhorses were taken away, and we stood watching from the front porch when Mr. Radley made his final journey past our house. “There goes the meanest man ever God blew breath into,” murmured Calpurnia, and she spat meditatively into the yard. We looked at her in surprise, for Calpurnia rarely commented on the ways of white people. The neighborhood thought when Mr. Radley went under Boo would come out, but it had another think coming: Boo’s elder brother returned from Pensacola and took Mr. Radley’s place. The only difference between him and his father was their ages. Jem said Mr. Nathan Radley “bought cotton,” too. Mr. Nathan would speak to us, however, when we said good morning, and sometimes we saw him coming from town with a magazine in his hand. The more we told Dill about the Radleys, the more he wanted to know, the longer he would stand hugging the light-pole on the corner, the more he would wonder. “Wonder what he does in there,” he would murmur. “Looks like he’d just stick his head out the door.”","chpiterTitle":"Death","key":3},
                    {"chapiter":"Jem said, “He goes out, all right, when it’s pitch dark. Miss Stephanie Crawford said she woke up in the middle of the night one time and saw him looking straight through the window at her... said his head was like a skull lookin‘ at her. Ain’t you ever waked up at night and heard him, Dill? He walks like this-” Jem slid his feet through the gravel. “Why do you think Miss Rachel locks up so tight at night? I’ve seen his tracks in our back yard many a mornin’, and one night I heard him scratching on the back screen, but he was gone time Atticus got there.” “Wonder what he looks like?” said Dill. Jem gave a reasonable description of Boo: Boo was about six-and-a-half feet tall, judging from his tracks; he dined on raw squirrels and any cats he could catch, that’s why his hands were bloodstained—if you ate an animal raw, you could never wash the blood off. There was a long jagged scar that ran across his face; what teeth he had were yellow and rotten; his eyes popped, and he drooled most of the time. “Let’s try to make him come out,” said Dill. “I’d like to see what he looks like.” Jem said if Dill wanted to get himself killed, all he had to do was go up and knock on the front door. Our first raid came to pass only because Dill bet Jem The Gray Ghost against two Tom Swifts that Jem wouldn’t get any farther than the Radley gate. In all his life, Jem had never declined a dare. Jem thought about it for three days. I suppose he loved honor more than his head, for Dill wore him down easily: “You’re scared,” Dill said, the first day. “Ain’t scared, just respectful,” Jem said. The next day Dill said, “You’re too scared even to put your big toe in the front yard.” Jem said he reckoned he wasn’t, he’d passed the Radley Place every school day of his life. “Always runnin‘,” I said. But Dill got him the third day, when he told Jem that folks in Meridian certainly weren’t as afraid as the folks in Maycomb, that he’d never seen such scary folks as the ones in Maycomb. This was enough to make Jem march to the corner, where he stopped and leaned against the light-pole, watching the gate hanging crazily on its homemade hinge. “I hope you’ve got it through your head that he’ll kill us each and every one, Dill Harris,” said Jem, when we joined him. “Don’t blame me when he gouges your eyes out. You started it, remember.” “You’re still scared,” murmured Dill patiently. Jem wanted Dill to know once and for all that he wasn’t scared of anything: “It’s just that I can’t think of a way to make him come out without him gettin‘ us.” Besides, Jem had his little sister to think of. When he said that, I knew he was afraid. Jem had his little sister to think of the time I dared him to jump off the top of the house: “If I got killed, what’d become of you?” he asked. Then he jumped, landed unhurt, and his sense of responsibility left him until confronted by the Radley Place. “You gonna run out on a dare?” asked Dill. “If you are, then-” “Dill, you have to think about these things,” Jem said. “Lemme think a minute... it’s sort of like making a turtle come out...” “How’s that?” asked Dill. “Strike a match under him.” I told Jem if he set fire to the Radley house I was going to tell Atticus on him. Dill said striking a match under a turtle was hateful. “Ain’t hateful, just persuades him—‘s not like you’d chunk him in the fire,” Jem growled. “How do you know a match don’t hurt him?” “Turtles can’t feel, stupid,” said Jem. “Were you ever a turtle, huh?” “My stars, Dill! Now lemme think... reckon we can rock him...” Jem stood in thought so long that Dill made a mild concession: “I won’t say you ran out on a dare an‘ I’ll swap you The Gray Ghost if you just go up and touch the house.” Jem brightened. “Touch the house, that all?” Dill nodded. “Sure that’s all, now? I don’t want you hollerin‘ something different the minute I get back.” “Yeah, that’s all,” said Dill. “He’ll probably come out after you when he sees you in the yard, then Scout’n‘ me’ll jump on him and hold him down till we can tell him we ain’t gonna hurt him.” We left the corner, crossed the side street that ran in front of the Radley house, and stopped at the gate. “Well go on,” said Dill, “Scout and me’s right behind you.” “I’m going,” said Jem, “don’t hurry me.” He walked to the corner of the lot, then back again, studying the simple terrain as if deciding how best to effect an entry, frowning and scratching his head. Then I sneered at him. Jem threw open the gate and sped to the side of the house, slapped it with his palm and ran back past us, not waiting to see if his foray was successful. Dill and I followed on his heels. Safely on our porch, panting and out of breath, we looked back. The old house was the same, droopy and sick, but as we stared down the street we thought we saw an inside shutter move. Flick. A tiny, almost invisible movement, and the house was still.","chpiterTitle":"Death","key":4},
                    {"chapiter":"Dill left us early in September, to return to Meridian. We saw him off on the fiveo’clock bus and I was miserable without him until it occurred to me that I wouldbe starting to school in a week. I never looked forward more to anything in mylife. Hours of wintertime had found me in the treehouse, looking over at theschoolyard, spying on multitudes of children through a two-power telescope Jemhad given me, learning their games, following Jem’s red jacket through wrigglingcircles of blind man’s buff, secretly sharing their misfortunes and minor victories.I longed to join them.Jem condescended to take me to school the first day, a job usually done by one’sparents, but Atticus had said Jem would be delighted to show me where my roomwas. I think some money changed hands in this transaction, for as we trottedaround the corner past the Radley Place I heard an unfamiliar jingle in Jem’spockets. When we slowed to a walk at the edge of the schoolyard, Jem wascareful to explain that during school hours I was not to bother him, I was not toapproach him with requests to enact a chapter of Tarzan and the Ant Men, toembarrass him with references to his private life, or tag along behind him atrecess and noon. I was to stick with the first grade and he would stick with thefifth. In short, I was to leave him alone.“You mean we can’t play any more?” I asked.“We’ll do like we always do at home,” he said, “but you’ll see—school’sdifferent.”It certainly was. Before the first morning was over, Miss Caroline Fisher, ourteacher, hauled me up to the front of the room and patted the palm of my handwith a ruler, then made me stand in the corner until noon.Miss Caroline was no more than twenty-one. She had bright auburn hair, pinkcheeks, and wore crimson fingernail polish. She also wore high-heeled pumps anda red-and-white-striped dress. She looked and smelled like a peppermint drop.She boarded across the street one door down from us in Miss Maudie Atkinson’supstairs front room, and when Miss Maudie introduced us to her, Jem was in ahaze for days.Miss Caroline printed her name on the blackboard and said, “This says I am MissCaroline Fisher. I am from North Alabama, from Winston County.” The classmurmured apprehensively, should she prove to harbor her share of thepeculiarities indigenous to that region. (When Alabama seceded from the Unionon January 11, 1861, Winston County seceded from Alabama, and every child inMaycomb County knew it.) North Alabama was full of Liquor Interests, BigMules, steel companies, Republicans, professors, and other persons of nobackground.Miss Caroline began the day by reading us a story about cats. The cats had longconversations with one another, they wore cunning little clothes and lived in awarm house beneath a kitchen stove. By the time Mrs. Cat called the drugstore foran order of chocolate malted mice the class was wriggling like a bucketful ofcatawba worms. Miss Caroline seemed unaware that the ragged, denim-shirtedand floursack-skirted first grade, most of whom had chopped cotton and fed hogsfrom the time they were able to walk, were immune to imaginative literature.Miss Caroline came to the end of the story and said, “Oh, my, wasn’t that nice?”Then she went to the blackboard and printed the alphabet in enormous squarecapitals, turned to the class and asked, “Does anybody know what these are?”Everybody did; most of the first grade had failed it last year.I suppose she chose me because she knew my name; as I read the alphabet a faintline appeared between her eyebrows, and after making me read most of My FirstReader and the stock-market quotations from The Mobile Register aloud, shediscovered that I was literate and looked at me with more than faint distaste. MissCaroline told me to tell my father not to teach me any more, it would interferewith my reading.“Teach me?” I said in surprise. “He hasn’t taught me anything, Miss Caroline.Atticus ain’t got time to teach me anything,” I added, when Miss Caroline smiledand shook her head. “Why, he’s so tired at night he just sits in the livingroom andreads.”“If he didn’t teach you, who did?” Miss Caroline asked good-naturedly.“Somebody did. You weren’t born reading The Mobile Register.”“Jem says I was. He read in a book where I was a Bullfinch instead of a Finch.Jem says my name’s really Jean Louise Bullfinch, that I got swapped when I wasborn and I’m really a-”Miss Caroline apparently thought I was lying. “Let’s not let our imaginations runaway with us, dear,” she said. “Now you tell your father not to teach you anymore. It’s best to begin reading with a fresh mind. You tell him I’ll take over fromhere and try to undo the damage-”“Ma’am?”“Your father does not know how to teach. You can have a seat now.”I mumbled that I was sorry and retired meditating upon my crime. I neverdeliberately learned to read, but somehow I had been wallowing illicitly in thedaily papers. In the long hours of church—was it then I learned? I could notremember not being able to read hymns. Now that I was compelled to think aboutit, reading was something that just came to me, as learning to fasten the seat ofmy union suit without looking around, or achieving two bows from a snarl ofshoelaces. I could not remember when the lines above Atticus’s moving fingerseparated into words, but I had stared at them all the evenings in my memory,listening to the news of the day, Bills to Be Enacted into Laws, the diaries ofLorenzo Dow—anything Atticus happened to be reading when I crawled into hislap every night. Until I feared I would lose it, I never loved to read. One does notlove breathing.I knew I had annoyed Miss Caroline, so I let well enough alone and stared out thewindow until recess when Jem cut me from the covey of first-graders in theschoolyard. He asked how I was getting along. I told him.“If I didn’t have to stay I’d leave. Jem, that damn lady says Atticus’s beenteaching me to read and for him to stop it-”“Don’t worry, Scout,” Jem comforted me. “Our teacher says Miss Caroline’sintroducing a new way of teaching. She learned about it in college. It’ll be in allthe grades soon. You don’t have to learn much out of books that way—it’s like ifyou wanta learn about cows, you go milk one, see?”“Yeah Jem, but I don’t wanta study cows, I-”“Sure you do. You hafta know about cows, they’re a big part of life in MaycombCounty.”I contented myself with asking Jem if he’d lost his mind.“I’m just trying to tell you the new way they’re teachin‘ the first grade, stubborn.It’s the Dewey Decimal System.”Having never questioned Jem’s pronouncements, I saw no reason to begin now.The Dewey Decimal System consisted, in part, of Miss Caroline waving cards atus on which were printed “the,” “cat,” “rat,” “man,” and “you.” No commentseemed to be expected of us, and the class received these impressionisticrevelations in silence. I was bored, so I began a letter to Dill. Miss Carolinecaught me writing and told me to tell my father to stop teaching me. “Besides,”she said. “We don’t write in the first grade, we print. You won’t learn to writeuntil you’re in the third grade.”Calpurnia was to blame for this. It kept me from driving her crazy on rainy days, Iguess. She would set me a writing task by scrawling the alphabet firmly across thetop of a tablet, then copying out a chapter of the Bible beneath. If I reproducedher penmanship satisfactorily, she rewarded me with an open-faced sandwich ofbread and butter and sugar. In Calpurnia’s teaching, there was no sentimentality: Iseldom pleased her and she seldom rewarded me.“Everybody who goes home to lunch hold up your hands,” said Miss Caroline,breaking into my new grudge against Calpurnia.The town children did so, and she looked us over.“Everybody who brings his lunch put it on top of his desk.”Molasses buckets appeared from nowhere, and the ceiling danced with metalliclight. Miss Caroline walked up and down the rows peering and poking into lunchcontainers, nodding if the contents pleased her, frowning a little at others. Shestopped at Walter Cunningham’s desk. “Where’s yours?” she asked.Walter Cunningham’s face told everybody in the first grade he had hookworms.His absence of shoes told us how he got them. People caught hookworms goingbarefooted in barnyards and hog wallows. If Walter had owned any shoes hewould have worn them the first day of school and then discarded them until mid-winter. He did have on a clean shirt and neatly mended overalls.“Did you forget your lunch this morning?” asked Miss Caroline.Walter looked straight ahead. I saw a muscle jump in his skinny jaw.“Did you forget it this morning?” asked Miss Caroline. Walter’s jaw twitchedagain.“Yeb’m,” he finally mumbled.Miss Caroline went to her desk and opened her purse. “Here’s a quarter,” she saidto Walter. “Go and eat downtown today. You can pay me back tomorrow.”Walter shook his head. “Nome thank you ma’am,” he drawled softly.Impatience crept into Miss Caroline’s voice: “Here Walter, come get it.”Walter shook his head again.When Walter shook his head a third time someone whispered, “Go on and tellher, Scout.”I turned around and saw most of the town people and the entire bus delegationlooking at me. Miss Caroline and I had conferred twice already, and they werelooking at me in the innocent assurance that familiarity breeds understanding.I rose graciously on Walter’s behalf: “Ah—Miss Caroline?”“What is it, Jean Louise?”“Miss Caroline, he’s a Cunningham.”I sat back down.“What, Jean Louise?”I thought I had made things sufficiently clear. It was clear enough to the rest ofus: Walter Cunningham was sitting there lying his head off. He didn’t forget hislunch, he didn’t have any. He had none today nor would he have any tomorrow orthe next day. He had probably never seen three quarters together at the same timein his life.I tried again: “Walter’s one of the Cunninghams, Miss Caroline.”“I beg your pardon, Jean Louise?”“That’s okay, ma’am, you’ll get to know all the county folks after a while. TheCunninghams never took anything they can’t pay back—no church baskets and noscrip stamps. They never took anything off of anybody, they get along on whatthey have. They don’t have much, but they get along on it.”My special knowledge of the Cunningham tribe—one branch, that is—was gainedfrom events of last winter. Walter’s father was one of Atticus’s clients. After adreary conversation in our livingroom one night about his entailment, before Mr.Cunningham left he said, “Mr. Finch, I don’t know when I’ll ever be able to payyou.”“Let that be the least of your worries, Walter,” Atticus said.","chpiterTitle":"Death","key":5},
                    {"chapiter":"When I asked Jem what entailment was, and Jem described it as a condition of having your tail in a crack, I asked Atticus if Mr. Cunningham would ever pay us. “Not in money,” Atticus said, “but before the year’s out I’ll have been paid. You watch.” We watched. One morning Jem and I found a load of stovewood in the back yard. Later, a sack of hickory nuts appeared on the back steps. With Christmas came a crate of smilax and holly. That spring when we found a crokersack full of turnip greens, Atticus said Mr. Cunningham had more than paid him. “Why does he pay you like that?” I asked. “Because that’s the only way he can pay me. He has no money.” “Are we poor, Atticus?” Atticus nodded. “We are indeed.” Jem’s nose wrinkled. “Are we as poor as the Cunninghams?” “Not exactly. The Cunninghams are country folks, farmers, and the crash hit them hardest.” Atticus said professional people were poor because the farmers were poor. As Maycomb County was farm country, nickels and dimes were hard to come by for doctors and dentists and lawyers. Entailment was only a part of Mr. Cunningham’s vexations. The acres not entailed were mortgaged to the hilt, and the little cash he made went to interest. If he held his mouth right, Mr. Cunningham could get a WPA job, but his land would go to ruin if he left it, and he was willing to go hungry to keep his land and vote as he pleased. Mr. Cunningham, said Atticus, came from a set breed of men. As the Cunninghams had no money to pay a lawyer, they simply paid us with what they had. “Did you know,” said Atticus, “that Dr. Reynolds works the same way? He charges some folks a bushel of potatoes for delivery of a baby. Miss Scout, if you give me your attention I’ll tell you what entailment is. Jem’s definitions are very nearly accurate sometimes.” If I could have explained these things to Miss Caroline, I would have saved myself some inconvenience and Miss Caroline subsequent mortification, but it was beyond my ability to explain things as well as Atticus, so I said, “You’re shamin‘ him, Miss Caroline. Walter hasn’t got a quarter at home to bring you, and you can’t use any stovewood.” Miss Caroline stood stock still, then grabbed me by the collar and hauled me back to her desk. “Jean Louise, I’ve had about enough of you this morning,” she said. “You’re starting off on the wrong foot in every way, my dear. Hold out your hand.” I thought she was going to spit in it, which was the only reason anybody in Maycomb held out his hand: it was a time-honored method of sealing oral contracts. Wondering what bargain we had made, I turned to the class for an answer, but the class looked back at me in puzzlement. Miss Caroline picked up her ruler, gave me half a dozen quick little pats, then told me to stand in the corner. A storm of laughter broke loose when it finally occurred to the class that Miss Caroline had whipped me. When Miss Caroline threatened it with a similar fate the first grade exploded again, becoming cold sober only when the shadow of Miss Blount fell over them. Miss Blount, a native Maycombian as yet uninitiated in the mysteries of the Decimal System, appeared at the door hands on hips and announced: “If I hear another sound from this room I’ll burn up everybody in it. Miss Caroline, the sixth grade cannot concentrate on the pyramids for all this racket!” My sojourn in the corner was a short one. Saved by the bell, Miss Caroline watched the class file out for lunch. As I was the last to leave, I saw her sink down into her chair and bury her head in her arms. Had her conduct been more friendly toward me, I would have felt sorry for her. She was a pretty little thing.","chpiterTitle":"Death","key":6}
                
            ]
        },
        {
            "novelTitle": "The Alchemist",
            "statu": "completed",
            "year": "1988",
            "description": "’The Alchemist’ is a philosophical novel written by Brazilian author Paulo Coelho. Originally published in Portuguese in 1988, it has since been translated into numerous languages and has become a worldwide bestseller. The book follows the journey of a young Andalusian shepherd named Santiago who dreams of finding a hidden treasure. Encountering various characters and experiencing transformative events, Santiago embarks on a quest that takes him from his homeland to the mystical pyramids of Egypt.",
            "fav":false,
            "images":
                {
                    "imagePath": "https://i.pinimg.com/564x/6f/79/20/6f7920c9580c44ef38f68223da531b03.jpg",
                    "imagePath2": "https://i.pinimg.com/564x/50/3b/64/503b64ed65bb037f78aa74cf56abd217.jpg"
                },
            "rating": 8.4,
            "chapiters":[
                
                {"chapiter":"The boy's name was Santiago. Dusk was falling as the boy arrived with his herd at an abandoned church. The roof had fallen in long ago, and an enormous sycamore had grown on the spot where the sacristy had once stood. He decided to spend the night there. He saw to it that all the sheep entered through the ruined gate, and then laid some planks across it to prevent the flock from wandering away during the night. There were no wolves in the region, but once an animal had strayed during the night, and the boy had had to spend the entire next day searching for it. He swept the floor with his jacket and lay down, using the book he had just finished reading as a pillow. He told himself that he would have to start reading thicker books: they lasted longer, and made more comfortable pillows. It was still dark when he awoke, and, looking up, he could see the stars through the half- destroyed roof. I wanted to sleep a little longer, he thought. He had had the same dream that night as a week ago, and once again he had awakened before it ended. He arose and, taking up his crook, began to awaken the sheep that still slept. He had noticed that, as soon as he awoke, most of his animals also began to stir. It was as if some mysterious energy bound his life to that of the sheep, with whom he had spent the past two years, leading them through the countryside in search of food and water. They are so used to me that they know my schedule, he muttered. Thinking about that for a moment, he realized that it could be the other way around: that it was he who had become accustomed to their schedule. But there were certain of them who took a bit longer to awaken. The boy prodded them, one by one, with his crook, calling each by name. He had always believed that the sheep were able to understand what he said. So there were times when he read them parts of his books that had made an impression on him, or when he would tell them of the loneliness or the happiness of a shepherd in the fields. Sometimes he would comment to them on the things he had seen in the villages they passed. But for the past few days he had spoken to them about only one thing: the girl, the daughter of a merchant who lived in the village they would reach in about four days. He had been to the village only once, the year before. The merchant was the proprietor of a dry goods shop, and he always demanded that the sheep be sheared in his presence, so that he would not be cheated. A friend had told the boy about the shop, and he had taken his sheep there. * I need to sell some wool, the boy told the merchant. The shop was busy, and the man asked the shepherd to wait until the afternoon. So the boy sat on the steps of the shop and took a book from his bag. I didn't know shepherds knew how to read, said a girl's voice behind him. The girl was typical of the region of Andalusia, with flowing black hair, and eyes that vaguely recalled the Moorish conquerors. Well, usually I learn more from my sheep than from books, he answered. During the two hours that they talked, she told him she was the merchant's daughter, and spoke of life in the village, where each day was like all the others. The shepherd told her of the Andalusian countryside, and related the news from the other towns where he had stopped. It was a pleasant change from talking to his sheep. How did you learn to read? the girl asked at one point. Like everybody learns, he said. In school. Well, if you know how to read, why are you just a shepherd? The boy mumbled an answer that allowed him to avoid responding to her question. He was sure the girl would never understand. He went on telling stories about his travels, and her bright, Moorish eyes went wide with fear and surprise. As the time passed, the boy found himself wishing that the day would never end, that her father would stay busy and keep him waiting for three days. He recognized that he was feeling something he had never experienced before: the desire to live in one place forever. With the girl with the raven hair, his days would never be the same again. But finally the merchant appeared, and asked the boy to shear four sheep. He paid for the wool and asked the shepherd to come back the following year. * And now it was only four days before he would be back in that same village. He was excited, and at the same time uneasy: maybe the girl had already forgotten him. Lots of shepherds passed through, selling their wool. It doesn't matter, he said to his sheep. I know other girls in other places. But in his heart he knew that it did matter. And he knew that shepherds, like seamen and like traveling salesmen, always found a town where there was someone who could make them forget the joys of carefree wandering. The day was dawning, and the shepherd urged his sheep in the direction of the sun. They never have to make any decisions, he thought. Maybe that's why they always stay close to me. The only things that concerned the sheep were food and water. As long as the boy knew how to find the best pastures in Andalusia, they would be his friends. Yes, their days were all the same, with the seemingly endless hours between sunrise and dusk; and they had never read a book in their young lives, and didn't understand when the boy told them about the sights of the cities. They were content with just food and water, and, in exchange, they generously gave of their wool, their company, and—once in a while— their meat. If I became a monster today, and decided to kill them, one by one, they would become aware only after most of the flock had been slaughtered, thought the boy. They trust me, and they've forgotten how to rely on their own instincts, because I lead them to nourishment. The boy was surprised at his thoughts. Maybe the church, with the sycamore growing from within, had been haunted. It had caused him to have the same dream for a second time, and it was causing him to feel anger toward his faithful companions. He drank a bit from the wine that remained from his dinner of the night before, and he gathered his jacket closer to his body. He knew that a few hours from now, with the sun at its zenith, the heat would be so great that he would not be able to lead his flock across the fields. It was the time of day when all of Spain slept during the summer. The heat lasted until nightfall, and all that time he had to carry his jacket. But when he thought to complain about the burden of its weight, he remembered that, because he had the jacket, he had withstood the cold of the dawn. We have to be prepared for change, he thought, and he was grateful for the jacket's weight and warmth. The jacket had a purpose, and so did the boy. His purpose in life was to travel, and, after two years of walking the Andalusian terrain, he knew all the cities of the region. He was planning, on this visit, to explain to the girl how it was that a simple shepherd knew how to read. That he had attended a seminary until he was sixteen. His parents had wanted him to become a priest, and thereby a source of pride for a simple farm family. They","chpiterTitle":"Death","key":1},
                {"chapiter":"worked hard just to have food and water, like the sheep. He had studied Latin, Spanish, and theology. But ever since he had been a child, he had wanted to know the world, and this was much more important to him than knowing God and learning about man's sins. One afternoon, on a visit to his family, he had summoned up the courage to tell his father that he didn't want to become a priest. That he wanted to travel.  *  People from all over the world have passed through this village, son, said his father. They come in search of new things, but when they leave they are basically the same people they were when they arrived. They climb the mountain to see the castle, and they wind up thinking that the past was better than what we have now. They have blond hair, or dark skin, but basically they're the same as the people who live right here. But I'd like to see the castles in the towns where they live, the boy explained. Those people, when they see our land, say that they would like to live here forever, his father continued. Well, I'd like to see their land, and see how they live, said his son. The people who come here have a lot of money to spend, so they can afford to travel, his father said. Amongst us, the only ones who travel are the shepherds. Well, then I'll be a shepherd! His father said no more. The next day, he gave his son a pouch that held three ancient Spanish gold coins. I found these one day in the fields. I wanted them to be a part of your inheritance. But use them to buy your flock. Take to the fields, and someday you'll learn that our countryside is the best, and our women the most beautiful. And he gave the boy his blessing. The boy could see in his father's gaze a desire to be able, himself, to travel the world—a desire that was still alive, despite his father's having had to bury it, over dozens of years, under the burden of struggling for water to drink, food to eat, and the same place to sleep every night of his life.  *  The horizon was tinged with red, and suddenly the sun appeared. The boy thought back to that conversation with his father, and felt happy; he had already seen many castles and met many women (but none the equal of the one who awaited him several days hence). He owned a jacket, a book that he could trade for another, and a flock of sheep. But, most important, he was able every day to live out his dream. If he were to tire of the Andalusian fields, he could sell his sheep and go to sea. By the time he had had enough  of the sea, he would already have known other cities, other women, and other chances to be happy. I couldn't have found God in the seminary, he thought, as he looked at the sunrise. Whenever he could, he sought out a new road to travel. He had never been to that ruined church before, in spite of having traveled through those parts many times. The world was huge and inexhaustible; he had only to allow his sheep to set the route for a while, and he would discover other interesting things. The problem is that they don't even realize that they're walking a new road every day. They don't see that the fields are new and the seasons change. All they think about is food and water. Maybe we're all that way, the boy mused. Even me—I haven't thought of other women since I met the merchant's daughter. Looking at the sun, he calculated that he would reach Tarifa before midday. There, he could exchange his book for a thicker one, fill his wine bottle, shave, and have a haircut; he had to prepare himself for his meeting with the girl, and he didn't want to think about the possibility that some other shepherd, with a larger flock of sheep, had arrived there before him and asked for her hand. It's the possibility of having a dream come true that makes life interesting, he thought, as he looked again at the position of the sun, and hurried his pace. He had suddenly remembered that, in Tarifa, there was an old woman who interpreted dreams.  *  The old woman led the boy to a room at the back of her house; it was separated from her living room by a curtain of colored beads. The room's furnishings consisted of a table, an image of the Sacred Heart of Jesus, and two chairs. The woman sat down, and told him to be seated as well. Then she took both of his hands in hers, and began quietly to pray. It sounded like a Gypsy prayer. The boy had already had experience on the road with Gypsies; they also traveled, but they had no flocks of sheep. People said that Gypsies spent their lives tricking others. It was also said that they had a pact with the devil, and that they kidnapped children and, taking them away to their mysterious camps, made them their slaves. As a child, the boy had always been frightened to death that he would be captured by Gypsies, and this childhood fear returned when the old woman took his hands in hers. But she has the Sacred Heart of Jesus there, he thought, trying to reassure himself. He didn't want his hand to begin trembling, showing the old woman that he was fearful. He recited an Our Father silently. Very interesting, said the woman, never taking her eyes from the boy's hands, and then she fell silent.  The boy was becoming nervous. His hands began to tremble, and the woman sensed it. He quickly pulled his hands away. I didn't come here to have you read my palm, he said, already regretting having come. He thought for a moment that it would be better to pay her fee and leave without learning a thing, that he was giving too much importance to his recurrent dream. You came so that you could learn about your dreams, said the old woman. And dreams are the language of God. When he speaks in our language, I can interpret what he has said. But if he speaks in the language of the soul, it is only you who can understand. But, whichever it is, I'm going to charge you for the consultation. Another trick, the boy thought. But he decided to take a chance. A shepherd always takes his chances with wolves and with drought, and that's what makes a shepherd's life exciting. I have had the same dream twice, he said. I dreamed that I was in a field with my sheep, when a child appeared and began to play with the animals. I don't like people to do that, because the sheep are afraid of strangers. But children always seem to be able to play with them without frightening them. I don't know why. I don't know how animals know the age of human beings. Tell me more about your dream, said the woman. I have to get back to my cooking, and, since you don't have much money, I can't give you a lot of time. The child went on playing with my sheep for quite a while, continued the boy, a bit upset. And suddenly, the child took me by both hands and transported me to the Egyptian pyramids. He paused for a moment to see if the woman knew what the Egyptian pyramids were. But she said nothing. Then, at the Egyptian pyramids,—he said the last three words slowly, so that the old woman would understand—the child said to me, If you come here, you will find a hidden treasure.' And, just as she was about to show me the exact location, I woke up. Both times. The woman was silent for some time. Then she again took his hands and studied them carefully. I'm not going to charge you anything now, she said. But I want one-tenth of the treasure, if you find it. The boy laughed—out of happiness. He was going to be able to save the little money he had because of a dream about hidden treasure!  Well, interpret the dream, he said. First, swear to me. Swear that you will give me one-tenth of your treasure in exchange for what I am going to tell you. The shepherd swore that he would. The old woman asked him to swear again while looking at the image of the Sacred Heart of Jesus. It's a dream in the language of the world, she said. I can interpret it, but the interpretation is very difficult. That's why I feel that I deserve a part of what you find. And this is my interpretation: you must go to the Pyramids in Egypt. I have never heard of them, but, if it was a child who showed them to you, they exist. There you will find a treasure that will make you a rich man. The boy was surprised, and then irritated. He didn't need to seek out the old woman for this! But then he remembered that he wasn't going to have to pay anything. I didn't need to waste my time just for this, he said. I told you that your dream was a difficult one. It's the simple things in life that are the most extraordinary; only wise men are able to understand them. And since I am not wise, I have had to learn other arts, such as the reading of palms. Well, how am I going to get to Egypt? I only interpret dreams. I don't know how to turn them into reality. That's why I have to live off what my daughters provide me with. And what if I never get to Egypt? Then I don't get paid. It wouldn't be the first time. And the woman told the boy to leave, saying she had already wasted too much time with him. So the boy was disappointed; he decided that he would never again believe in dreams. He remembered that he had a number of things he had to take care of: he went to the market for something to eat, he traded his book for one that was thicker, and he found a bench in the plaza where he could sample the new wine he had bought. The day was hot, and the wine was refreshing. The sheep were at the gates of the city, in a stable that belonged to a friend. The boy knew a lot of people in the city. That was what made traveling appeal to him—he always made new friends, and he didn't need to spend all of his time with them. When someone sees the same people every day, as had happened with him at the seminary, they wind up becoming a part of that person's life. And then they want the person to change. If someone isn't what others want them to be, the others become angry.  Everyone seems to have a clear idea of how other people should lead their lives, but none about his or her own. He decided to wait until the sun had sunk a bit lower in the sky before following his flock back through the fields. Three days from now, he would be with the merchant's daughter. He started to read the book he had bought. On the very first page it described a burial ceremony. And the names of the people involved were very difficult to pronounce. If he ever wrote a book, he thought, he would present one person at a time, so that the reader wouldn't have to worry about memorizing a lot of names. When he was finally able to concentrate on what he was reading, he liked the book better; the burial was on a snowy day, and he welcomed the feeling of being cold. As he read on, an old man sat down at his side and tried to strike up a conversation. What are they doing? the old man asked, pointing at the people in the plaza. Working, the boy answered dryly, making it look as if he wanted to concentrate on his reading. Actually, he was thinking about shearing his sheep in front of the merchant's daughter, so that she could see that he was someone who was capable of doing difficult things. He had already imagined the scene many times; every time, the girl became fascinated when he explained that the sheep had to be sheared from back to front. He also tried to remember some good stories to relate as he sheared the sheep. Most of them he had read in books, but he would tell them as if they were from his personal experience. She would never know the difference, because she didn't know how to read. Meanwhile, the old man persisted in his attempt to strike up a conversation. He said that he was tired and thirsty, and asked if he might have a sip of the boy's wine. The boy offered his bottle, hoping that the old man would leave him alone. But the old man wanted to talk, and he asked the boy what book he was reading. The boy was tempted to be rude, and move to another bench, but his father had taught him to be respectful of the elderly. So he held out the book to the man—for two reasons: first, that he, himself, wasn't sure how to pronounce the title; and second, that if the old man didn't know how to read, he would probably feel ashamed and decide of his own accord to change benches. Hmm... said the old man, looking at all sides of the book, as if it were some strange object. This is an important book, but it's really irritating. The boy was shocked. The old man knew how to read, and had already read the book. And if the book was irritating, as the old man had said, the boy still had time to change it for another.  It's a book that says the same thing almost all the other books in the world say, continued the old man. It describes people's inability to choose their own destinies. And it ends up saying that everyone believes the world's greatest lie. What's the world's greatest lie? the boy asked, completely surprised. It's this: that at a certain point in our lives, we lose control of what's happening to us, and our lives become controlled by fate. That's the world's greatest lie. That's never happened to me, the boy said. They wanted me to be a priest, but I decided to become a shepherd. Much better, said the old man. Because you really like to travel. He knew what I was thinking, the boy said to himself. The old man, meanwhile, was leafing through the book, without seeming to want to return it at all. The boy noticed that the man's clothing was strange. He looked like an Arab, which was not unusual in those parts. Africa was only a few hours from Tarifa; one had only to cross the narrow straits by boat. Arabs often appeared in the city, shopping and chanting their strange prayers several times a day. Where are you from? the boy asked. From many places. No one can be from many places, the boy said. I'm a shepherd, and I have been to many places, but I come from only one place—from a city near an ancient castle. That's where I was born. Well then, we could say that I was born in Salem. The boy didn't know where Salem was, but he didn't want to ask, fearing that he would appear ignorant. He looked at the people in the plaza for a while; they were coming and going, and all of them seemed to be very busy. So, what is Salem like? he asked, trying to get some sort of clue. It's like it always has been. No clue yet. But he knew that Salem wasn't in Andalusia. If it were, he would already have heard of it. And what do you do in Salem? he insisted. What do I do in Salem? The old man laughed. Well, I'm the king of Salem!  People say strange things, the boy thought. Sometimes it's better to be with the sheep, who don't say anything. And better still to be alone with one's books. They tell their incredible stories at the time when you want to hear them. But when you're talking to people, they say some things that are so strange that you don't know how to continue the conversation. My name is Melchizedek, said the old man. How many sheep do you have? Enough, said the boy. He could see that the old man wanted to know more about his life. Well, then, we've got a problem. I can't help you if you feel you've got enough sheep. The boy was getting irritated. He wasn't asking for help. It was the old man who had asked for a drink of his wine, and had started the conversation. Give me my book, the boy said. I have to go and gather my sheep and get going. Give me one-tenth of your sheep, said the old man, and I'll tell you how to find the hidden treasure. The boy remembered his dream, and suddenly everything was clear to him. The old woman hadn't charged him anything, but the old man—maybe he was her husband—was going to find a way to get much more money in exchange for information about something that didn't even exist. The old man was probably a Gypsy, too. But before the boy could say anything, the old man leaned over, picked up a stick, and began to write in the sand of the plaza. Something bright reflected from his chest with such intensity that the boy was momentarily blinded. With a movement that was too quick for someone his age, the man covered whatever it was with his cape. When his vision returned to normal, the boy was able to read what the old man had written in the sand. There, in the sand of the plaza of that small city, the boy read the names of his father and his mother and the name of the seminary he had attended. He read the name of the merchant's daughter, which he hadn't even known, and he read things he had never told anyone.  * I'm the king of Salem, the old man had said. Why would a king be talking with a shepherd? the boy asked, awed and embarrassed. For several reasons. But let's say that the most important is that you have succeeded in discovering your destiny.","chpiterTitle":"Death","key":2},
                {"chapiter":"The boy didn't know what a person's destiny was. It's what you have always wanted to accomplish. Everyone, when they are young, knows what their destiny is. At that point in their lives, everything is clear and everything is possible. They are not afraid to dream, and to yearn for everything they would like to see happen to them in their lives. But, as time passes, a mysterious force begins to convince them that it will be impossible for them to realize their destiny. None of what the old man was saying made much sense to the boy. But he wanted to know what the mysterious force was; the merchant's daughter would be impressed when he told her about that! It's a force that appears to be negative, but actually shows you how to realize your destiny. It prepares your spirit and your will, because there is one great truth on this planet: whoever you are, or whatever it is that you do, when you really want something, it's because that desire originated in the soul of the universe. It's your mission on earth. Even when all you want to do is travel? Or marry the daughter of a textile merchant? Yes, or even search for treasure. The Soul of the World is nourished by people's happiness. And also by unhappiness, envy, and jealousy. To realize one's destiny is a person's only real obligation. All things are one. And, when you want something, all the universe conspires in helping you to achieve it. They were both silent for a time, observing the plaza and the townspeople. It was the old man who spoke first. Why do you tend a flock of sheep? Because I like to travel. The old man pointed to a baker standing in his shop window at one corner of the plaza. When he was a child, that man wanted to travel, too. But he decided first to buy his bakery and put some money aside. When he's an old man, he's going to spend a month in Africa. He never realized that people are capable, at any time in their lives, of doing what they dream of. He should have decided to become a shepherd, the boy said. Well, he thought about that, the old man said. But bakers are more important people than shepherds. Bakers have homes, while shepherds sleep out in the open. Parents would rather see their children marry bakers than shepherds.  The boy felt a pang in his heart, thinking about the merchant's daughter. There was surely a baker in her town. The old man continued, In the long run, what people think about shepherds and bakers becomes more important for them than their own destinies. The old man leafed through the book, and fell to reading a page he came to. The boy waited, and then interrupted the old man just as he himself had been interrupted. Why are you telling me all this? Because you are trying to realize your destiny. And you are at the point where you're about to give it all up. And that's when you always appear on the scene? Not always in this way, but I always appear in one form or another. Sometimes I appear in the form of a solution, or a good idea. At other times, at a crucial moment, I make it easier for things to happen. There are other things I do, too, but most of the time people don't realize I've done them. The old man related that, the week before, he had been forced to appear before a miner, and had taken the form of a stone. The miner had abandoned everything to go mining for emeralds. For five years he had been working a certain river, and had examined hundreds of thousands of stones looking for an emerald. The miner was about to give it all up, right at the point when, if he were to examine just one more stone—just one more—he would find his emerald. Since the miner had sacrificed everything to his destiny, the old man decided to become involved. He transformed himself into a stone that rolled up to the miner's foot. The miner, with all the anger and frustration of his five fruitless years, picked up the stone and threw it aside. But he had thrown it with such force that it broke the stone it fell upon, and there, embedded in the broken stone, was the most beautiful emerald in the world. People learn, early in their lives, what is their reason for being, said the old man, with a certain bitterness. Maybe that's why they give up on it so early, too. But that's the way it is. The boy reminded the old man that he had said something about hidden treasure. Treasure is uncovered by the force of flowing water, and it is buried by the same currents, said the old man. If you want to learn about your own treasure, you will have to give me one-tenth of your flock. What about one-tenth of my treasure? The old man looked disappointed. If you start out by promising what you don't even have yet, you'll lose your desire to work toward getting it.  The boy told him that he had already promised to give one-tenth of his treasure to the Gypsy. Gypsies are experts at getting people to do that, sighed the old man. In any case, it's good that you've learned that everything in life has its price. This is what the Warriors of the Light try to teach. The old man returned the book to the boy. Tomorrow, at this same time, bring me a tenth of your flock. And I will tell you how to find the hidden treasure. Good afternoon. And he vanished around the corner of the plaza. *  The boy began again to read his book, but he was no longer able to concentrate. He was tense and upset, because he knew that the old man was right. He went over to the bakery and bought a loaf of bread, thinking about whether or not he should tell the baker what the old man had said about him. Sometimes it's better to leave things as they are, he thought to himself, and decided to say nothing. If he were to say anything, the baker would spend three days thinking about giving it all up, even though he had gotten used to the way things were. The boy could certainly resist causing that kind of anxiety for the baker. So he began to wander through the city, and found himself at the gates. There was a small building there, with a window at which people bought tickets to Africa. And he knew that Egypt was in Africa. Can I help you? asked the man behind the window. Maybe tomorrow, said the boy, moving away. If he sold just one of his sheep, he'd have enough to get to the other shore of the strait. The idea frightened him. Another dreamer, said the ticket seller to his assistant, watching the boy walk away. He doesn't have enough money to travel. While standing at the ticket window, the boy had remembered his flock, and decided he should go back to being a shepherd. In two years he had learned everything about shepherding: he knew how to shear sheep, how to care for pregnant ewes, and how to protect the sheep from wolves. He knew all the fields and pastures of Andalusia. And he knew what was the fair price for every one of his animals. He decided to return to his friend's stable by the longest route possible. As he walked past the city's castle, he interrupted his return, and climbed the stone ramp that led to the top of the wall. From there, he could see Africa in the distance. Someone had once told him that it was from there that the Moors had come, to occupy all of Spain.  He could see almost the entire city from where he sat, including the plaza where he had talked with the old man. Curse the moment I met that old man, he thought. He had come to the town only to find a woman who could interpret his dream. Neither the woman nor the old man were at all impressed by the fact that he was a shepherd. They were solitary individuals who no longer believed in things, and didn't understand that shepherds become attached to their sheep. He knew everything about each member of his flock: he knew which ones were lame, which one was to give birth two months from now, and which were the laziest. He knew how to shear them, and how to slaughter them. If he ever decided to leave them, they would suffer. The wind began to pick up. He knew that wind: people called it the levanter, because on it the Moors had come from the Levant at the eastern end of the Mediterranean. The levanter increased in intensity. Here I am, between my flock and my treasure, the boy thought. He had to choose between something he had become accustomed to and something he wanted to have. There was also the merchant's daughter, but she wasn't as important as his flock, because she didn't depend on him. Maybe she didn't even remember him. He was sure that it made no difference to her on which day he appeared: for her, every day was the same, and when each day is the same as the next, it's because people fail to recognize the good things that happen in their lives every day that the sun rises. I left my father, my mother, and the town castle behind. They have gotten used to my being away, and so have I. The sheep will get used to my not being there, too, the boy thought. From where he sat, he could observe the plaza. People continued to come and go from the baker's shop. A young couple sat on the bench where he had talked with the old man, and they kissed. That baker... he said to himself, without completing the thought. The levanter was still getting stronger, and he felt its force on his face. That wind had brought the Moors, yes, but it had also brought the smell of the desert and of veiled women. It had brought with it the sweat and the dreams of men who had once left to search for the unknown, and for gold and adventure—and for the Pyramids. The boy felt jealous of the freedom of the wind, and saw that he could have the same freedom. There was nothing to hold him back except himself. The sheep, the merchant's daughter, and the fields of Andalusia were only steps along the way to his destiny. The next day, the boy met the old man at noon. He brought six sheep with him. I'm surprised, the boy said. My friend bought all the other sheep immediately. He said that he had always dreamed of being a shepherd, and that it was a good omen. That's the way it always is, said the old man. It's called the principle of favorability. When you play cards the first time, you are almost sure to win. Beginner's luck.  Why is that? Because there is a force that wants you to realize your destiny; it whets your appetite with a taste of success. Then the old man began to inspect the sheep, and he saw that one was lame. The boy explained that it wasn't important, since that sheep was the most intelligent of the flock, and produced the most wool. Where is the treasure? he asked. It's in Egypt, near the Pyramids. The boy was startled. The old woman had said the same thing. But she hadn't charged him anything. In order to find the treasure, you will have to follow the omens. God has prepared a path for everyone to follow. You just have to read the omens that he left for you. Before the boy could reply, a butterfly appeared and fluttered between him and the old man. He remembered something his grandfather had once told him: that butterflies were a good omen. Like crickets, and like expectations; like lizards and four-leaf clovers. That's right, said the old man, able to read the boy's thoughts. Just as your grandfather taught you. These are good omens. The old man opened his cape, and the boy was struck by what he saw. The old man wore a breastplate of heavy gold, covered with precious stones. The boy recalled the brilliance he had noticed on the previous day. He really was a king! He must be disguised to avoid encounters with thieves. Take these, said the old man, holding out a white stone and a black stone that had been embedded at the center of the breastplate. They are called Urim and Thummim. The black signifies 'yes,' and the white 'no.' When you are unable to read the omens, they will help you to do so. Always ask an objective question. But, if you can, try to make your own decisions. The treasure is at the Pyramids; that you already knew. But I had to insist on the payment of six sheep because I helped you to make your decision. The boy put the stones in his pouch. From then on, he would make his own decisions. Don't forget that everything you deal with is only one thing and nothing else. And don't forget the language of omens. And, above all, don't forget to follow your destiny through to its conclusion.","chpiterTitle":"Death","key":3},
                {"chapiter":"But before I go, I want to tell you a little story. A certain shopkeeper sent his son to learn about the secret of happiness from the wisest man in the world. The lad wandered through the desert for forty days, and finally came upon a beautiful castle, high atop a mountain. It was there that the wise man lived. Rather than finding a saintly man, though, our hero, on entering the main room of the castle, saw a hive of activity: tradesmen came and went, people were conversing in the corners, a small orchestra was playing soft music, and there was a table covered with platters of the most delicious food in that part of the world. The wise man conversed with everyone, and the boy had to wait for two hours before it was his turn to be given the man's attention. The wise man listened attentively to the boy's explanation of why he had come, but told him that he didn't have time just then to explain the secret of happiness. He suggested that the boy look around the palace and return in two hours. 'Meanwhile, I want to ask you to do something,' said the wise man, handing the boy a teaspoon that held two drops of oil. 'As you wander around, carry this spoon with you without allowing the oil to spill.' The boy began climbing and descending the many stairways of the palace, keeping his eyes fixed on the spoon. After two hours, he returned to the room where the wise man was. 'Well,' asked the wise man, 'did you see the Persian tapestries that are hanging in my dining hall? Did you see the garden that it took the master gardener ten years to create? Did you notice the beautiful parchments in my library?' The boy was embarrassed, and confessed that he had observed nothing. His only concern had been not to spill the oil that the wise man had entrusted to him. 'Then go back and observe the marvels of my world,' said the wise man. 'You cannot trust a man if you don't know his house.' Relieved, the boy picked up the spoon and returned to his exploration of the palace, this time observing all of the works of art on the ceilings and the walls. He saw the gardens, the mountains all around him, the beauty of the flowers, and the taste with which everything had been selected. Upon returning to the wise man, he related in detail everything he had seen. 'But where are the drops of oil I entrusted to you?' asked the wise man. Looking down at the spoon he held, the boy saw that the oil was gone.  'Well, there is only one piece of advice I can give you,' said the wisest of wise men. 'The secret of happiness is to see all the marvels of the world, and never to forget the drops of oil on the spoon.'  The shepherd said nothing. He had understood the story the old king had told him. A shepherd may like to travel, but he should never forget about his sheep. The old man looked at the boy and, with his hands held together, made several strange gestures over the boy's head. Then, taking his sheep, he walked away.  *  At the highest point in Tarifa there is an old fort, built by the Moors. From atop its walls, one can catch a glimpse of Africa. Melchizedek, the king of Salem, sat on the wall of the fort that afternoon, and felt the levanter blowing in his face. The sheep fidgeted nearby, uneasy with their new owner and excited by so much change. All they wanted was food and water. Melchizedek watched a small ship that was plowing its way out of the port. He would never again see the boy, just as he had never seen Abraham again after having charged him his one-tenth fee. That was his work. The gods should not have desires, because they don't have destinies. But the king of Salem hoped desperately that the boy would be successful. It's too bad that he's quickly going to forget my name, he thought. I should have repeated it for him. Then when he spoke about me he would say that I am Melchizedek, the king of Salem. He looked to the skies, feeling a bit abashed, and said, I know it's the vanity of vanities, as you said, my Lord. But an old king sometimes has to take some pride in himself.  * How strange Africa is, thought the boy. He was sitting in a bar very much like the other bars he had seen along the narrow streets of Tangier. Some men were smoking from a gigantic pipe that they passed from one to the other. In just a few hours he had seen men walking hand in hand, women with their faces covered, and priests that climbed to the tops of towers and chanted—as everyone about him went to their knees and placed their foreheads on the ground. A practice of infidels, he said to himself. As a child in church, he had always looked at the image of Saint Santiago Matamoros on his white horse, his sword unsheathed, and figures such as these kneeling at his feet. The boy felt ill and terribly alone. The infidels had an evil look about them.  Besides this, in the rush of his travels he had forgotten a detail, just one detail, which could keep him from his treasure for a long time: only Arabic was spoken in this country. The owner of the bar approached him, and the boy pointed to a drink that had been served at the next table. It turned out to be a bitter tea. The boy preferred wine. But he didn't need to worry about that right now. What he had to be concerned about was his treasure, and how he was going to go about getting it. The sale of his sheep had left him with enough money in his pouch, and the boy knew that in money there was magic; whoever has money is never really alone. Before long, maybe in just a few days, he would be at the Pyramids. An old man, with a breastplate of gold, wouldn't have lied just to acquire six sheep. The old man had spoken about signs and omens, and, as the boy was crossing the strait, he had thought about omens. Yes, the old man had known what he was talking about: during the time the boy had spent in the fields of Andalusia, he had become used to learning which path he should take by observing the ground and the sky. He had discovered that the presence of a certain bird meant that a snake was nearby, and that a certain shrub was a sign that there was water in the area. The sheep had taught him that. If God leads the sheep so well, he will also lead a man, he thought, and that made him feel better. The tea seemed less bitter. Who are you? he heard a voice ask him in Spanish. The boy was relieved. He was thinking about omens, and someone had appeared. How come you speak Spanish? he asked. The new arrival was a young man in Western dress, but the color of his skin suggested he was from this city. He was about the same age and height as the boy. Almost everyone here speaks Spanish. We're only two hours from Spain. Sit down, and let me treat you to something, said the boy. And ask for a glass of wine for me. I hate this tea. There is no wine in this country, the young man said. The religion here forbids it. The boy told him then that he needed to get to the Pyramids. He almost began to tell about his treasure, but decided not to do so. If he did, it was possible that the Arab would want a part of it as payment for taking him there. He remembered what the old man had said about offering something you didn't even have yet. I'd like you to take me there if you can. I can pay you to serve as my guide. Do you have any idea how to get there? the newcomer asked.  The boy noticed that the owner of the bar stood nearby, listening attentively to their conversation. He felt uneasy at the man's presence. But he had found a guide, and didn't want to miss out on an opportunity. You have to cross the entire Sahara desert, said the young man. And to do that, you need money. I need to know whether you have enough. The boy thought it a strange question. But he trusted in the old man, who had said that, when you really want something, the universe always conspires in your favor. He took his money from his pouch and showed it to the young man. The owner of the bar came over and looked, as well. The two men exchanged some words in Arabic, and the bar owner seemed irritated. Let's get out of here said the new arrival. He wants us to leave. The boy was relieved. He got up to pay the bill, but the owner grabbed him and began to speak to him in an angry stream of words. The boy was strong, and wanted to retaliate, but he was in a foreign country. His new friend pushed the owner aside, and pulled the boy outside with him. He wanted your money, he said. Tangier is not like the rest of Africa. This is a port, and every port has its thieves. The boy trusted his new friend. He had helped him out in a dangerous situation. He took out his money and counted it. We could get to the Pyramids by tomorrow, said the other, taking the money. But I have to buy two camels. They walked together through the narrow streets of Tangier. Everywhere there were stalls with items for sale. They reached the center of a large plaza where the market was held. There were thousands of people there, arguing, selling, and buying; vegetables for sale amongst daggers, and carpets displayed alongside tobacco. But the boy never took his eye off his new friend. After all, he had all his money. He thought about asking him to give it back, but decided that would be unfriendly. He knew nothing about the customs of the strange land he was in. I'll just watch him, he said to himself. He knew he was stronger than his friend. Suddenly, there in the midst of all that confusion, he saw the most beautiful sword he had ever seen. The scabbard was embossed in silver, and the handle was black and encrusted with precious stones. The boy promised himself that, when he returned from Egypt, he would buy that sword. Ask the owner of that stall how much the sword costs, he said to his friend. Then he realized that he had been distracted for a few moments, looking at the sword. His heart","chpiterTitle":"Death","key":4}
            
        ]
        }
    ]
}
